vanhao-hub/usb_key_authen/src/core/mcxa156/sdks/frdm_mcxa156_sdk/devices/MCXA156/cmsis_drivers/fsl_lpspi_cmsis.c
static int32_t LPSPI6_EdmaPowerControl(ARM_POWER_STATE state)
{
    return LPSPI_EdmaPowerControl(state, &LPSPI6_EdmaDriverState);
}

static int32_t LPSPI6_EdmaSend(const void *data, uint32_t num)
{
    return LPSPI_EdmaSend(data, num, &LPSPI6_EdmaDriverState);
}

static int32_t LPSPI6_EdmaReceive(void *data, uint32_t num)
{
    return LPSPI_EdmaReceive(data, num, &LPSPI6_EdmaDriverState);
}

static int32_t LPSPI6_EdmaTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPSPI_EdmaTransfer(data_out, data_in, num, &LPSPI6_EdmaDriverState);
}

static uint32_t LPSPI6_EdmaGetCount(void)
{
    return LPSPI_EdmaGetCount(&LPSPI6_EdmaDriverState);
}

static int32_t LPSPI6_EdmaControl(uint32_t control, uint32_t arg)
{
    return LPSPI_EdmaControl(control, arg, &LPSPI6_EdmaDriverState);
}

static ARM_SPI_STATUS LPSPI6_EdmaGetStatus(void)
{
    return LPSPI_EdmaGetStatus(&LPSPI6_EdmaDriverState);
}

#endif

#else

static cmsis_lpspi_handle_t LPSPI6_Handle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("lpspi6_interrupt_driver_state")
static cmsis_lpspi_interrupt_driver_state_t LPSPI6_InterruptDriverState = {
#else
static cmsis_lpspi_interrupt_driver_state_t LPSPI6_InterruptDriverState = {
#endif
    &LPSPI6_Resource,
    &LPSPI6_Handle,
};

static int32_t LPSPI6_InterruptInitialize(ARM_SPI_SignalEvent_t cb_event)
{
#ifdef RTE_SPI6_PIN_INIT
    RTE_SPI6_PIN_INIT();
#endif
    return LPSPI_InterruptInitialize(cb_event, &LPSPI6_InterruptDriverState);
}

static int32_t LPSPI6_InterruptUninitialize(void)
{
#ifdef RTE_SPI6_PIN_DEINIT
    RTE_SPI6_PIN_DEINIT();
#endif
    return LPSPI_InterruptUninitialize(&LPSPI6_InterruptDriverState);
}

static int32_t LPSPI6_InterruptPowerControl(ARM_POWER_STATE state)
{
    return LPSPI_InterruptPowerControl(state, &LPSPI6_InterruptDriverState);
}

static int32_t LPSPI6_InterruptSend(const void *data, uint32_t num)
{
    return LPSPI_InterruptSend(data, num, &LPSPI6_InterruptDriverState);
}

static int32_t LPSPI6_InterruptReceive(void *data, uint32_t num)
{
    return LPSPI_InterruptReceive(data, num, &LPSPI6_InterruptDriverState);
}

static int32_t LPSPI6_InterruptTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPSPI_InterruptTransfer(data_out, data_in, num, &LPSPI6_InterruptDriverState);
}

static uint32_t LPSPI6_InterruptGetCount(void)
{
    return LPSPI_InterruptGetCount(&LPSPI6_InterruptDriverState);
}

static int32_t LPSPI6_InterruptControl(uint32_t control, uint32_t arg)
{
    return LPSPI_InterruptControl(control, arg, &LPSPI6_InterruptDriverState);
}

static ARM_SPI_STATUS LPSPI6_InterruptGetStatus(void)
{
    return LPSPI_InterruptGetStatus(&LPSPI6_InterruptDriverState);
}

#endif

ARM_DRIVER_SPI Driver_SPI6 = {
    LPSPIx_GetVersion,     LPSPIx_GetCapabilities,
#if defined(RTE_SPI6_DMA_EN) && RTE_SPI6_DMA_EN
    LPSPI6_EdmaInitialize, LPSPI6_EdmaUninitialize, LPSPI6_EdmaPowerControl, LPSPI6_EdmaSend,     LPSPI6_EdmaReceive,
    LPSPI6_EdmaTransfer,   LPSPI6_EdmaGetCount,     LPSPI6_EdmaControl,      LPSPI6_EdmaGetStatus
#else
    LPSPI6_InterruptInitialize, LPSPI6_InterruptUninitialize, LPSPI6_InterruptPowerControl, LPSPI6_InterruptSend,
    LPSPI6_InterruptReceive,    LPSPI6_InterruptTransfer,     LPSPI6_InterruptGetCount,     LPSPI6_InterruptControl,
    LPSPI6_InterruptGetStatus
#endif
};

#endif /*  LPSPI6  */

#if (defined(LPSPI7) || defined(LPSPI_7)) && defined(RTE_SPI7) && RTE_SPI7

/* User needs to provide the implementation for LPSPI7_GetFreq/InitPins/DeinitPins
in the application for enabling according instance. */
extern uint32_t LPSPI7_GetFreq(void);

#if defined(LPSPI7)
static cmsis_lpspi_resource_t LPSPI7_Resource = {LPSPI7, 7, LPSPI7_GetFreq};
#elif defined(LPSPI_7)
static cmsis_lpspi_resource_t LPSPI7_Resource = {LPSPI_7, 7, LPSPI7_GetFreq};
#endif

#if defined(RTE_SPI7_DMA_EN) && RTE_SPI7_DMA_EN

#if (defined(FSL_FEATURE_SOC_EDMA_COUNT) && FSL_FEATURE_SOC_EDMA_COUNT)
static cmsis_lpspi_edma_resource_t LPSPI7_EdmaResource = {
    RTE_SPI7_DMA_TX_DMA_BASE,    RTE_SPI7_DMA_TX_CH,          (uint16_t)RTE_SPI7_DMA_TX_PERI_SEL,
    RTE_SPI7_DMA_RX_DMA_BASE,    RTE_SPI7_DMA_RX_CH,          (uint16_t)RTE_SPI7_DMA_RX_PERI_SEL,
#if (defined(FSL_FEATURE_SOC_DMAMUX_COUNT) && FSL_FEATURE_SOC_DMAMUX_COUNT)
    RTE_SPI7_DMA_TX_DMAMUX_BASE, RTE_SPI7_DMA_RX_DMAMUX_BASE,
#endif
};

AT_NONCACHEABLE_SECTION(static cmsis_lpspi_edma_handle_t LPSPI7_EdmaHandle);
static edma_handle_t LPSPI7_EdmaTxDataToTxRegHandle;
static edma_handle_t LPSPI7_EdmaRxRegToRxDataHandle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("lpspi7_edma_driver_state")
static cmsis_lpspi_edma_driver_state_t LPSPI7_EdmaDriverState = {
#else
static cmsis_lpspi_edma_driver_state_t LPSPI7_EdmaDriverState = {
#endif
    &LPSPI7_Resource,
    &LPSPI7_EdmaResource,
    &LPSPI7_EdmaHandle,
    &LPSPI7_EdmaRxRegToRxDataHandle,
    &LPSPI7_EdmaTxDataToTxRegHandle,
};

static int32_t LPSPI7_EdmaInitialize(ARM_SPI_SignalEvent_t cb_event)
{
#ifdef RTE_SPI7_PIN_INIT
    RTE_SPI7_PIN_INIT();
#endif
    return LPSPI_EdmaInitialize(cb_event, &LPSPI7_EdmaDriverState);
}

static int32_t LPSPI7_EdmaUninitialize(void)
{
#ifdef RTE_SPI7_PIN_DEINIT
    RTE_SPI7_PIN_DEINIT();
#endif
    return LPSPI_EdmaUninitialize(&LPSPI7_EdmaDriverState);
}

static int32_t LPSPI7_EdmaPowerControl(ARM_POWER_STATE state)
{
    return LPSPI_EdmaPowerControl(state, &LPSPI7_EdmaDriverState);
}

static int32_t LPSPI7_EdmaSend(const void *data, uint32_t num)
{
    return LPSPI_EdmaSend(data, num, &LPSPI7_EdmaDriverState);
}

static int32_t LPSPI7_EdmaReceive(void *data, uint32_t num)
{
    return LPSPI_EdmaReceive(data, num, &LPSPI7_EdmaDriverState);
}

static int32_t LPSPI7_EdmaTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPSPI_EdmaTransfer(data_out, data_in, num, &LPSPI7_EdmaDriverState);
}

static uint32_t LPSPI7_EdmaGetCount(void)
{
    return LPSPI_EdmaGetCount(&LPSPI7_EdmaDriverState);
}

static int32_t LPSPI7_EdmaControl(uint32_t control, uint32_t arg)
{
    return LPSPI_EdmaControl(control, arg, &LPSPI7_EdmaDriverState);
}

static ARM_SPI_STATUS LPSPI7_EdmaGetStatus(void)
{
    return LPSPI_EdmaGetStatus(&LPSPI7_EdmaDriverState);
}

#endif

#else

static cmsis_lpspi_handle_t LPSPI7_Handle;

