vanhao-hub/usb_key_authen/src/core/mcxa156/sdks/frdm_mcxa156_sdk/devices/MCXA156/cmsis_drivers/fsl_lpspi_cmsis.c
#if (defined(LPSPI11) || defined(LPSPI_11)) && defined(RTE_SPI11) && RTE_SPI11

/* User needs to provide the implementation for LPSPI11_GetFreq/InitPins/DeinitPins
in the application for enabling according instance. */
extern uint32_t LPSPI11_GetFreq(void);

#if defined(LPSPI11)
static cmsis_lpspi_resource_t LPSPI11_Resource = {LPSPI11, 11, LPSPI11_GetFreq};
#elif defined(LPSPI_11)
static cmsis_lpspi_resource_t LPSPI11_Resource = {LPSPI_11, 11, LPSPI11_GetFreq};
#endif

#if defined(RTE_SPI11_DMA_EN) && RTE_SPI11_DMA_EN

#if (defined(FSL_FEATURE_SOC_EDMA_COUNT) && FSL_FEATURE_SOC_EDMA_COUNT)
static cmsis_lpspi_edma_resource_t LPSPI11_EdmaResource = {
    RTE_SPI11_DMA_TX_DMA_BASE,    RTE_SPI11_DMA_TX_CH,          (uint16_t)RTE_SPI11_DMA_TX_PERI_SEL,
    RTE_SPI11_DMA_RX_DMA_BASE,    RTE_SPI11_DMA_RX_CH,          (uint16_t)RTE_SPI11_DMA_RX_PERI_SEL,
#if (defined(FSL_FEATURE_SOC_DMAMUX_COUNT) && FSL_FEATURE_SOC_DMAMUX_COUNT)
    RTE_SPI11_DMA_TX_DMAMUX_BASE, RTE_SPI11_DMA_RX_DMAMUX_BASE,
#endif
};

AT_NONCACHEABLE_SECTION(static cmsis_lpspi_edma_handle_t LPSPI11_EdmaHandle);
static edma_handle_t LPSPI11_EdmaTxDataToTxRegHandle;
static edma_handle_t LPSPI11_EdmaRxRegToRxDataHandle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("lpspi11_edma_driver_state")
static cmsis_lpspi_edma_driver_state_t LPSPI11_EdmaDriverState = {
#else
static cmsis_lpspi_edma_driver_state_t LPSPI11_EdmaDriverState = {
#endif
    &LPSPI11_Resource,
    &LPSPI11_EdmaResource,
    &LPSPI11_EdmaHandle,
    &LPSPI11_EdmaRxRegToRxDataHandle,
    &LPSPI11_EdmaTxDataToTxRegHandle,
};

static int32_t LPSPI11_EdmaInitialize(ARM_SPI_SignalEvent_t cb_event)
{
#ifdef RTE_SPI11_PIN_INIT
    RTE_SPI11_PIN_INIT();
#endif
    return LPSPI_EdmaInitialize(cb_event, &LPSPI11_EdmaDriverState);
}

static int32_t LPSPI11_EdmaUninitialize(void)
{
#ifdef RTE_SPI11_PIN_DEINIT
    RTE_SPI11_PIN_DEINIT();
#endif
    return LPSPI_EdmaUninitialize(&LPSPI11_EdmaDriverState);
}

static int32_t LPSPI11_EdmaPowerControl(ARM_POWER_STATE state)
{
    return LPSPI_EdmaPowerControl(state, &LPSPI11_EdmaDriverState);
}

static int32_t LPSPI11_EdmaSend(const void *data, uint32_t num)
{
    return LPSPI_EdmaSend(data, num, &LPSPI11_EdmaDriverState);
}

static int32_t LPSPI11_EdmaReceive(void *data, uint32_t num)
{
    return LPSPI_EdmaReceive(data, num, &LPSPI11_EdmaDriverState);
}

static int32_t LPSPI11_EdmaTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPSPI_EdmaTransfer(data_out, data_in, num, &LPSPI11_EdmaDriverState);
}

static uint32_t LPSPI11_EdmaGetCount(void)
{
    return LPSPI_EdmaGetCount(&LPSPI11_EdmaDriverState);
}

static int32_t LPSPI11_EdmaControl(uint32_t control, uint32_t arg)
{
    return LPSPI_EdmaControl(control, arg, &LPSPI11_EdmaDriverState);
}

static ARM_SPI_STATUS LPSPI11_EdmaGetStatus(void)
{
    return LPSPI_EdmaGetStatus(&LPSPI11_EdmaDriverState);
}

#endif

#else

static cmsis_lpspi_handle_t LPSPI11_Handle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("lpspi11_interrupt_driver_state")
static cmsis_lpspi_interrupt_driver_state_t LPSPI11_InterruptDriverState = {
#else
static cmsis_lpspi_interrupt_driver_state_t LPSPI11_InterruptDriverState = {
#endif
    &LPSPI11_Resource,
    &LPSPI11_Handle,
};

static int32_t LPSPI11_InterruptInitialize(ARM_SPI_SignalEvent_t cb_event)
{
#ifdef RTE_SPI11_PIN_INIT
    RTE_SPI11_PIN_INIT();
#endif
    return LPSPI_InterruptInitialize(cb_event, &LPSPI11_InterruptDriverState);
}

static int32_t LPSPI11_InterruptUninitialize(void)
{
#ifdef RTE_SPI11_PIN_DEINIT
    RTE_SPI11_PIN_DEINIT();
#endif
    return LPSPI_InterruptUninitialize(&LPSPI11_InterruptDriverState);
}

static int32_t LPSPI11_InterruptPowerControl(ARM_POWER_STATE state)
{
    return LPSPI_InterruptPowerControl(state, &LPSPI11_InterruptDriverState);
}

static int32_t LPSPI11_InterruptSend(const void *data, uint32_t num)
{
    return LPSPI_InterruptSend(data, num, &LPSPI11_InterruptDriverState);
}

static int32_t LPSPI11_InterruptReceive(void *data, uint32_t num)
{
    return LPSPI_InterruptReceive(data, num, &LPSPI11_InterruptDriverState);
}

static int32_t LPSPI11_InterruptTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPSPI_InterruptTransfer(data_out, data_in, num, &LPSPI11_InterruptDriverState);
}

static uint32_t LPSPI11_InterruptGetCount(void)
{
    return LPSPI_InterruptGetCount(&LPSPI11_InterruptDriverState);
}

static int32_t LPSPI11_InterruptControl(uint32_t control, uint32_t arg)
{
    return LPSPI_InterruptControl(control, arg, &LPSPI11_InterruptDriverState);
}

static ARM_SPI_STATUS LPSPI11_InterruptGetStatus(void)
{
    return LPSPI_InterruptGetStatus(&LPSPI11_InterruptDriverState);
}

#endif

ARM_DRIVER_SPI Driver_SPI11 = {
    LPSPIx_GetVersion,      LPSPIx_GetCapabilities,
#if defined(RTE_SPI11_DMA_EN) && RTE_SPI11_DMA_EN
    LPSPI11_EdmaInitialize, LPSPI11_EdmaUninitialize, LPSPI11_EdmaPowerControl, LPSPI11_EdmaSend,
    LPSPI11_EdmaReceive,    LPSPI11_EdmaTransfer,     LPSPI11_EdmaGetCount,     LPSPI11_EdmaControl,
    LPSPI11_EdmaGetStatus
#else
    LPSPI11_InterruptInitialize, LPSPI11_InterruptUninitialize, LPSPI11_InterruptPowerControl, LPSPI11_InterruptSend,
    LPSPI11_InterruptReceive,    LPSPI11_InterruptTransfer,     LPSPI11_InterruptGetCount,     LPSPI11_InterruptControl,
    LPSPI11_InterruptGetStatus
#endif
};

#endif /*  LPSPI11  */

#if (defined(LPSPI12) || defined(LPSPI_12)) && defined(RTE_SPI12) && RTE_SPI12

/* User needs to provide the implementation for LPSPI12_GetFreq/InitPins/DeinitPins
in the application for enabling according instance. */
extern uint32_t LPSPI12_GetFreq(void);

#if defined(LPSPI12)
static cmsis_lpspi_resource_t LPSPI12_Resource = {LPSPI12, 12, LPSPI12_GetFreq};
#elif defined(LPSPI_12)
static cmsis_lpspi_resource_t LPSPI12_Resource = {LPSPI_12, 12, LPSPI12_GetFreq};
#endif

