vanhao-hub/usb_key_authen/src/core/mcxa156/sdks/frdm_mcxa156_sdk/devices/MCXA156/cmsis_drivers/fsl_lpspi_cmsis.c
static uint32_t LPSPI16_InterruptGetCount(void)
{
    return LPSPI_InterruptGetCount(&LPSPI16_InterruptDriverState);
}

static int32_t LPSPI16_InterruptControl(uint32_t control, uint32_t arg)
{
    return LPSPI_InterruptControl(control, arg, &LPSPI16_InterruptDriverState);
}

static ARM_SPI_STATUS LPSPI16_InterruptGetStatus(void)
{
    return LPSPI_InterruptGetStatus(&LPSPI16_InterruptDriverState);
}

#endif

ARM_DRIVER_SPI Driver_SPI16 = {
    LPSPIx_GetVersion,      LPSPIx_GetCapabilities,
#if defined(RTE_SPI16_DMA_EN) && RTE_SPI16_DMA_EN
    LPSPI16_EdmaInitialize, LPSPI16_EdmaUninitialize, LPSPI16_EdmaPowerControl, LPSPI16_EdmaSend,
    LPSPI16_EdmaReceive,    LPSPI16_EdmaTransfer,     LPSPI16_EdmaGetCount,     LPSPI16_EdmaControl,
    LPSPI16_EdmaGetStatus
#else
    LPSPI16_InterruptInitialize, LPSPI16_InterruptUninitialize, LPSPI16_InterruptPowerControl, LPSPI16_InterruptSend,
    LPSPI16_InterruptReceive,    LPSPI16_InterruptTransfer,     LPSPI16_InterruptGetCount,     LPSPI16_InterruptControl,
    LPSPI16_InterruptGetStatus
#endif
};

#endif /*  LPSPI16  */

#if (defined(LPSPI17) || defined(LPSPI_17)) && defined(RTE_SPI17) && RTE_SPI17

/* User needs to provide the implementation for LPSPI17_GetFreq/InitPins/DeinitPins
in the application for enabling according instance. */
extern uint32_t LPSPI17_GetFreq(void);

#if defined(LPSPI17)
static cmsis_lpspi_resource_t LPSPI17_Resource = {LPSPI17, 17, LPSPI17_GetFreq};
#elif defined(LPSPI_17)
static cmsis_lpspi_resource_t LPSPI17_Resource = {LPSPI_17, 17, LPSPI17_GetFreq};
#endif

#if defined(RTE_SPI17_DMA_EN) && RTE_SPI17_DMA_EN

#if (defined(FSL_FEATURE_SOC_EDMA_COUNT) && FSL_FEATURE_SOC_EDMA_COUNT)
static cmsis_lpspi_edma_resource_t LPSPI17_EdmaResource = {
    RTE_SPI17_DMA_TX_DMA_BASE,    RTE_SPI17_DMA_TX_CH,          (uint16_t)RTE_SPI17_DMA_TX_PERI_SEL,
    RTE_SPI17_DMA_RX_DMA_BASE,    RTE_SPI17_DMA_RX_CH,          (uint16_t)RTE_SPI17_DMA_RX_PERI_SEL,
#if (defined(FSL_FEATURE_SOC_DMAMUX_COUNT) && FSL_FEATURE_SOC_DMAMUX_COUNT)
    RTE_SPI17_DMA_TX_DMAMUX_BASE, RTE_SPI17_DMA_RX_DMAMUX_BASE,
#endif
};

AT_NONCACHEABLE_SECTION(static cmsis_lpspi_edma_handle_t LPSPI17_EdmaHandle);
static edma_handle_t LPSPI17_EdmaTxDataToTxRegHandle;
static edma_handle_t LPSPI17_EdmaRxRegToRxDataHandle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("lpspi17_edma_driver_state")
static cmsis_lpspi_edma_driver_state_t LPSPI17_EdmaDriverState = {
#else
static cmsis_lpspi_edma_driver_state_t LPSPI17_EdmaDriverState = {
#endif
    &LPSPI17_Resource,
    &LPSPI17_EdmaResource,
    &LPSPI17_EdmaHandle,
    &LPSPI17_EdmaRxRegToRxDataHandle,
    &LPSPI17_EdmaTxDataToTxRegHandle,
};

static int32_t LPSPI17_EdmaInitialize(ARM_SPI_SignalEvent_t cb_event)
{
#ifdef RTE_SPI17_PIN_INIT
    RTE_SPI17_PIN_INIT();
#endif
    return LPSPI_EdmaInitialize(cb_event, &LPSPI17_EdmaDriverState);
}

static int32_t LPSPI17_EdmaUninitialize(void)
{
#ifdef RTE_SPI17_PIN_DEINIT
    RTE_SPI17_PIN_DEINIT();
#endif
    return LPSPI_EdmaUninitialize(&LPSPI17_EdmaDriverState);
}

static int32_t LPSPI17_EdmaPowerControl(ARM_POWER_STATE state)
{
    return LPSPI_EdmaPowerControl(state, &LPSPI17_EdmaDriverState);
}

static int32_t LPSPI17_EdmaSend(const void *data, uint32_t num)
{
    return LPSPI_EdmaSend(data, num, &LPSPI17_EdmaDriverState);
}

static int32_t LPSPI17_EdmaReceive(void *data, uint32_t num)
{
    return LPSPI_EdmaReceive(data, num, &LPSPI17_EdmaDriverState);
}

static int32_t LPSPI17_EdmaTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPSPI_EdmaTransfer(data_out, data_in, num, &LPSPI17_EdmaDriverState);
}

static uint32_t LPSPI17_EdmaGetCount(void)
{
    return LPSPI_EdmaGetCount(&LPSPI17_EdmaDriverState);
}

static int32_t LPSPI17_EdmaControl(uint32_t control, uint32_t arg)
{
    return LPSPI_EdmaControl(control, arg, &LPSPI17_EdmaDriverState);
}

static ARM_SPI_STATUS LPSPI17_EdmaGetStatus(void)
{
    return LPSPI_EdmaGetStatus(&LPSPI17_EdmaDriverState);
}

#endif

#else

static cmsis_lpspi_handle_t LPSPI17_Handle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("lpspi17_interrupt_driver_state")
static cmsis_lpspi_interrupt_driver_state_t LPSPI17_InterruptDriverState = {
#else
static cmsis_lpspi_interrupt_driver_state_t LPSPI17_InterruptDriverState = {
#endif
    &LPSPI17_Resource,
    &LPSPI17_Handle,
};

static int32_t LPSPI17_InterruptInitialize(ARM_SPI_SignalEvent_t cb_event)
{
#ifdef RTE_SPI17_PIN_INIT
    RTE_SPI17_PIN_INIT();
#endif
    return LPSPI_InterruptInitialize(cb_event, &LPSPI17_InterruptDriverState);
}

static int32_t LPSPI17_InterruptUninitialize(void)
{
#ifdef RTE_SPI17_PIN_DEINIT
    RTE_SPI17_PIN_DEINIT();
#endif
    return LPSPI_InterruptUninitialize(&LPSPI17_InterruptDriverState);
}

static int32_t LPSPI17_InterruptPowerControl(ARM_POWER_STATE state)
{
    return LPSPI_InterruptPowerControl(state, &LPSPI17_InterruptDriverState);
}

static int32_t LPSPI17_InterruptSend(const void *data, uint32_t num)
{
    return LPSPI_InterruptSend(data, num, &LPSPI17_InterruptDriverState);
}

static int32_t LPSPI17_InterruptReceive(void *data, uint32_t num)
{
    return LPSPI_InterruptReceive(data, num, &LPSPI17_InterruptDriverState);
}

static int32_t LPSPI17_InterruptTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPSPI_InterruptTransfer(data_out, data_in, num, &LPSPI17_InterruptDriverState);
}

static uint32_t LPSPI17_InterruptGetCount(void)
{
    return LPSPI_InterruptGetCount(&LPSPI17_InterruptDriverState);
}

static int32_t LPSPI17_InterruptControl(uint32_t control, uint32_t arg)
{
    return LPSPI_InterruptControl(control, arg, &LPSPI17_InterruptDriverState);
}

static ARM_SPI_STATUS LPSPI17_InterruptGetStatus(void)
{
    return LPSPI_InterruptGetStatus(&LPSPI17_InterruptDriverState);
}

#endif

